<template>
  <!-- 协议 -->
  <view class="agreement">
    <u-popup
      :show="show"
      :name="name"
      :consultant="consultant"
      :type="type"
      :second="second"
      @close="close"
      :agree="agree"
      mode="center"
      round="10"
      :closeOnClickOverlay="false"
      overlayOpacity="0.7"
      bgColor="transparent"
    >
      <view class="pop-box" v-if="type == 0">
        <view class="pop-top">
          <view class="pop-title">《咨询服务协议》</view>
          <view class="pop-tip">本咨询服务协议由以下三方通过网络签署:</view>
          <view class="pop-sign">
            <view class="sign-left">甲方(签约专家):</view>
            <view class="sign-right">{{ consultant }}</view>
          </view>
          <view class="pop-sign">
            <view class="sign-left">乙方(求助者):</view>
            <view class="sign-right">{{ name }}</view>
          </view>
          <view class="pop-sign">
            <view class="sign-left">丙方:</view>
            <view class="sign-right">易馨亿翼（上海）信息科技有限公司</view>
          </view>
          <view class="pop-sign">
            <view class="sign-left">地址:</view>
            <view class="sign-right"
              >上海市奉贤区航南公路5699号宝龙广场2号楼9层1010室</view
            >
          </view>
          <view class="bold">鉴于:</view>
          <view class="thin">
            1、丙方是一家根据中国法律合法成立并有效存续的有限责任公司，合法拥有蓝鸟心理咨询服务平台的经营权，提供信息咨询、技术服务等。<br />
            2、甲方为持有中国的自然人，已与两方签约为丙方平台签约专家，并承诺其提供给丙方的信息是完全真实的。<br />
            3、乙方为丙方平台的注册用户，并承诺其提供给丙方的信息是完全真实的;<br />
            4、现乙方有意向甲方寻求专业心理咨询，甲方亦愿意向乙方提供相关服务。<br />
            5、甲、乙双方在本协议签署前已经仔细阅读并充分理解丙方放置在丙方平台上的相关内容、规则、本协议版本及免责声明，并已经确认同意相关交易规则。
          </view>
          <view class="bold"
            >各方经友好协商一致，签订如下协议，以兹共同遵照履行</view
          >
          <view class="bold">第一条 服务内容</view>
          <view class="thin">
            1.1、
            (甲方同意向乙方提供小时以下简称“服务时间”)的心理咨询服务，甲、乙双方明确并同意，在乙方完成本协议项下服务费支付义务后，具体服务时间自乙方与甲方通过丙方平台预约的服务时间到达时开始计算。<br />
            若甲、乙双方并未预约服务时间，则在乙方完成本协议项下服务费支付义务后，具体服务时间自乙方通过丙方平台接受甲方服务之时起开始计算。<br />
            1.2、甲方在提供本协议项下心理咨询服务时，应严格遵守相关法律法规、行业规范及平台规则的要求，尽其所能为乙方提供不低于行业同等水平的服务。<br />
            1.3、乙方明确并承诺，其已经明确心理咨询业务规则，理解且同意本协议项下的心理咨询服务可能并不会产生直接强烈、明显的效果，在接受服务后亦可能产生的其他后果，乙方愿意承担该等后果。<br />
            1.4、乙方明确并承诺，其在接受心理咨询过程中应向甲方如实说明自身情况及遇到的问题，并遵从甲方给出的专业性建议及意见。
          </view>
          <view class="bold">第二条服务费用</view>
          <view class="thin">
            2.1、乙方应就本协议项下的心理咨询服务向甲方支付咨询服务费。<br />
            2.2、甲、乙双方应向丙方支付信息技术服务费，甲方不可撤销的明确并同意，其原意代乙方支付全部信息技术服务费。<br />
            2.3、为完成交易之目的，甲方不可撤销的授权丙方代收乙方支付的咨询服务费，并授权丙方直接从代收的每笔咨询服务费中立即收取甲方应向丙方支付的信息技术服务费。丙方应根据其与甲方之间的协议按期足额向甲方支付扣除信息技术服务费后的剩余代收款项。具体付款流程如下:
            <br />
            (1)乙方将本协议第2.1条约定的咨询服务费支付至丙方后，方可向甲方发出心理咨询的意向通知；<br />
            (2)丙方确认收到乙方支付的咨询服务费后，应及时通过平台通知甲方该情况，同时亦应反馈至乙方其咨询服务费已经按平台规则支付，其有权在预约时间接受甲方提供的服务或是通过丙方平台向甲方提出服务申请；<br />
            (3)甲方在收到丙方的通知后应根据本协议及相关规则的规定及要求为乙方提供心理咨询服务；<br />
            (4)丙方应定期通过平台通知或短信等方式向甲方确认其信息技术服务费的支付情况，甲方亦有权登录其蓝鸟心理账户查询相关情况。<br />
            2.4、两方应妥善保存其代收的咨询服务费，并与其自有资金分开保存。非根据本协议、其他协议及相关规则的约定不得擅自挪用、移转或混同代收的咨询服务费。甲方明确并同意，丙方根据本协议代收代管咨询服务费期间，咨询服务费产生的利息归丙方所有。<br />
            2.5、甲方对于两方代收咨询服务费及扣除信息技术服务费存在疑问的，应当及时向丙方反馈，双方配合查清。<br />
            2.6、乙方在成功支付咨询服务费后，有权要求甲方就咨询服务费向其提供发票。<br />
            2.7、甲方在每次收到丙方向其支付的代收咨询服务费后有权要求丙方就信息技术服务费向其提供发票，除非乙方就甲方代其支付的信息技术服务费要求丙方向其提供发票。
          </view>
          <view class="bold">第三条 保密责任</view>
          <view class="thin">
            3.1、本协议及本协议履行过程中涉及的所有信息
            (包括但不限于乙方身份信息等)
            均为保密信息。各方应妥善保管相关信息，除本框架协议第3.2条约定的情形外，任何一方不得向第三方披露任何保密信息。<br />
            3.2、各方明确并同意，在下列情况下，任何一方可向第三方披露保密信息:<br />
            （1）已经取得其他各方事先书面确认;<br />
            （2）根据行政机关、司法机关的合理要求；<br />
            （3）公众已可通过其他合法渠道获知；<br />
            （4）丙方为完成本协议之目的，向内部工作人员、委托的中介机构披露保密信息。但披露方应保证内部工作人员、委托的中介机构，无论劳动关系、委托关系是否存续，均承担与披露方相同的保密义务。<br />
            3.3、任何一方擅自披露保密信息造成其他各方损失的，披露方应承担相应的赔偿责任。<br />
            3.4、本协议项下保密责任不会随本协议的失效、终止、撤销而失去效力。
          </view>
          <view class="bold">第四条 协议终止</view>
          <view class="thin">
            4.1、甲方有权在甲、乙方双方预约的服务时间到达[24]小时前通过丙方平台通知乙方及丙方解除本协议，但甲方应退还或委托丙方退还收取的全部咨询服务费，并承担由此给乙方及丙方造成的一切损失。甲方进一步明确，若甲方行使本条款约定之解除权，丙方已经收取的信息技术服务费不予退还。<br />
            4.2、丙方有权在甲方或乙方违反本协议约定时通过丙方平台通知甲方及乙方解除本协议。甲方应退还或委托丙方退还已经收取的、但尚未接受的心理咨询服务所对应的咨询服务费。若丙方因甲方违约而行使本条款约定之解除权，丙方已经收取的信息技术服务费不予退还，否则，两方应于解除本协议后的[7]个工作日内，将收取的信息技术服务费退还给甲方。<br />
            各方明确并同意，丙方行使本条款约定之解除权并不影响丙方追究违约方违约责任之权利。
          </view>
          <view class="bold">第五条 违约责任</view>
          <view class="thin">
            5.1、各方均应严格履行本协议，非经各方协商一致或依照本协议约定，任何一方不得解除本协议。<br />
            5.2、任何一方任何违反本协议约定的行为均构成违约，违约方应承担因违约而产生的赔偿责任并承担其余其他各方因违约而产生的其他费用和损失，包括但不限于调查费、诉讼费、律师费等。
          </view>
          <view class="bold">第六条 法律适用和争议解决</view>
          <view class="thin">
            6.1、本协议的效力、履行、终止、解释均适用中华人民共和国法律。<br />
            6.2、因本协议产生的任何争议，本协议任何一方均有权向丙方所在地有管辖权的法院提起诉讼解决。
          </view>
          <view class="bold">第七条 其他</view>
          <view class="thin">
            7.1、本协议由各方在线签署，采用电子文本形式制成，并保存在丙方为此设立的专用服务器上备查，各方均认可该形式的协议效力。<br />
            7.2、本协议的任何修改、补充均应以电子文本形式作出并于丙方平台公告。<br />
            7.3、本协议的任何条款被认定无效，其余条款并不受影响，依然有效。
          </view>
        </view>
        <view class="pop-btn agree" v-if="agree" @click="close">关闭</view>
        <template v-else>
          <view class="pop-btn" v-if="second > 0"
            >阅读倒计时 {{ second }}S</view
          >
          <view class="pop-btn agree" v-else @click="close">我同意授权</view>
        </template>
      </view>
      <view class="pop-box" v-if="type == 1">
        <view class="pop-top">
          <view class="pop-title">《课程购买协议》</view>
          <!-- <view class="pop-tip">本咨询服务协议由以下双方进行签署:</view>
					<view class="pop-sign">
						<view class="sign-left">甲方(用户/来访者姓名):</view>
						<view class="sign-right">{{ name }}</view>
					</view>
					<view class="pop-sign">
						<view class="sign-left">乙方(咨询师姓名):</view>
						<view class="sign-right">{{ consultant }}</view>
					</view> -->
          <view class="bold">一、协议适用</view>
          <view class="thin">
            1.
            协议中甲方为完全行为能力人。限制行为能力人(主要针对未成年人)应委托监护人履行协议签订手续。本协议不针对无行为能力人。
            乙方为咨询师,并承诺提供给甲方的资质信息为完全真实。
            2.一经发现甲方不具备前述主体资格进行咨询的,由此产生的一切后果由甲方及其监护人承担,且乙方有权立即停止向甲方提供咨询服务。
          </view>
          <view class="bold">二、甲方权利与义务权利</view>
          <view class="thin"
            >1.甲方可以根据个人意愿选择或更换乙方。
            2.甲方有权了解乙方的受训背景和执业资格</view
          >
        </view>
        <view class="pop-btn agree" v-if="agree" @click="close">关闭</view>
        <template v-else>
          <view class="pop-btn" v-if="second > 0"
            >阅读倒计时 {{ second }}S</view
          >
          <view class="pop-btn agree" v-else @click="close">我同意授权</view>
        </template>
      </view>
      <view class="pop-box" v-if="type == 2">
        <view class="pop-top">
          <view class="pop-title">《测评购买协议》</view>
          <!-- <view class="pop-tip">本咨询服务协议由以下双方进行签署:</view>
					<view class="pop-sign">
						<view class="sign-left">甲方(用户/来访者姓名):</view>
						<view class="sign-right">{{ name }}</view>
					</view>
					<view class="pop-sign">
						<view class="sign-left">乙方(咨询师姓名):</view>
						<view class="sign-right">{{ consultant }}</view>
					</view> -->
          <view class="bold">一、协议适用</view>
          <view class="thin">
            1.
            协议中甲方为完全行为能力人。限制行为能力人(主要针对未成年人)应委托监护人履行协议签订手续。本协议不针对无行为能力人。
            乙方为咨询师,并承诺提供给甲方的资质信息为完全真实。
            2.一经发现甲方不具备前述主体资格进行咨询的,由此产生的一切后果由甲方及其监护人承担,且乙方有权立即停止向甲方提供咨询服务。
          </view>
          <view class="bold">二、甲方权利与义务权利</view>
          <view class="thin"
            >1.甲方可以根据个人意愿选择或更换乙方。
            2.甲方有权了解乙方的受训背景和执业资格</view
          >
        </view>
        <view class="pop-btn agree" v-if="agree" @click="close">关闭</view>
        <template v-else>
          <view class="pop-btn" v-if="second > 0"
            >阅读倒计时 {{ second }}S</view
          >
          <view class="pop-btn agree" v-else @click="close">我同意授权</view>
        </template>
      </view>
      <view class="pop-box" v-if="type == 3">
        <view class="pop-top">
          <view class="pop-title">《知情同意》</view>
          <!-- <view class="pop-tip">本咨询服务协议由以下双方进行签署:</view>
					<view class="pop-sign">
						<view class="sign-left">甲方(用户/来访者姓名):</view>
						<view class="sign-right">{{ name }}</view>
					</view>
					<view class="pop-sign">
						<view class="sign-left">乙方(咨询师姓名):</view>
						<view class="sign-right">{{ consultant }}</view>
					</view> -->
          <view class="bold">一、协议适用</view>
          <view class="thin">
            1.
            协议中甲方为完全行为能力人。限制行为能力人(主要针对未成年人)应委托监护人履行协议签订手续。本协议不针对无行为能力人。
            乙方为咨询师,并承诺提供给甲方的资质信息为完全真实。
            2.一经发现甲方不具备前述主体资格进行咨询的,由此产生的一切后果由甲方及其监护人承担,且乙方有权立即停止向甲方提供咨询服务。
          </view>
          <view class="bold">二、甲方权利与义务权利</view>
          <view class="thin"
            >1.甲方可以根据个人意愿选择或更换乙方。
            2.甲方有权了解乙方的受训背景和执业资格</view
          >
        </view>
        <view class="pop-btn agree" v-if="agree" @click="close">关闭</view>
        <template v-else>
          <view class="pop-btn" v-if="second > 0"
            >阅读倒计时 {{ second }}S</view
          >
          <view class="pop-btn agree" v-else @click="close">我同意授权</view>
        </template>
      </view>
      <view class="pop-box" v-if="type == 4">
        <view class="pop-top">
          <view class="pop-title">《隐私政策》</view>
          <!-- <view class="pop-tip">本咨询服务协议由以下双方进行签署:</view>
					<view class="pop-sign">
						<view class="sign-left">甲方(用户/来访者姓名):</view>
						<view class="sign-right">{{ name }}</view>
					</view>
					<view class="pop-sign">
						<view class="sign-left">乙方(咨询师姓名):</view>
						<view class="sign-right">{{ consultant }}</view>
					</view> -->
          <view class="thin">
            更新日期：2023年09月 20日<br />
            生效日期：2023年09月 21日
          </view>
          <view class="thin">
            欢迎使用“蓝鸟心理”提供的产品和服务！蓝鸟心理（或简称“我们”）深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。如果您不同意本隐私权政策的任何内容，您应立即停止使用“蓝鸟心理”服务。当您使用蓝鸟心理提供的任一服务时，即表示您已同意我们按照本隐私政策来合法使用和保护您的个人信息。<br />
            请在使用我们的产品（或服务）前，仔细阅读并了解本《隐私政策》。 
          </view>
          <view class="thin"> 本《隐私政策》将帮助您了解以下内容： </view>
          <view class="bold">
            一、关于我们<br />
            二、我们如何收集和使用您的个人信息<br />
            三、我们如何使用 Cookie 和同类技术<br />
            四、我们如何保护您的个人信息<br />
            五、您的权利<br />
            六、第三方服务<br />
            七、本隐私权政策如何更新<br />
            八、如何联系我们<br />
          </view>
          <view class="thin">
            针对未满 14
            周岁的儿童及其监护人，特别保护政策与规则请阅读《蓝鸟心理儿童个人信息保护规则及监护人须知》。我们会根据您的同意和其它可处理您个人信息的法律依据收集、使用、存储、共享和转移您的个人信息。
          </view>
          <view class="bold">一、关于我们</view>
          <view class="thin">
            本应用名称为“蓝鸟心理”，由易馨亿翼（上海）信息科技有限公司（以下称“易馨亿翼”）提供软件开发、产品运营和服务。
          </view>
          <view class="bold">二、我们如何收集和使用您的个人信息</view>
          <view class="thin">
            个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。<br />
            我们仅会出于本政策所述的以下目的，收集和使用您的个人信息：<br />
            （一）为您提供网上预约咨询服务<br />
            1、业务功能一：注册成为用户<br />
            为完成创建账号，您需提供以下信息：姓名、性别、出生日期、所在地。<br />
            在注册过程中，如果您提供以下额外信息，将有助于我们给您提供更好的服务和体验：紧急联系人姓名、电话、所在地和关系等。<br />
            您提供的上述信息，将在您使用本服务期间持续授权我们使用。您应确保提供的注册信息为真实信息，且不违反国家法律法规的规定。我们有权基于手机号等信息对您进行真实身份信息核验与认证。如发现您提供虚假注册信息的，我们有权拒绝为您提供相关服务。<br />
            2、业务功能二：完成预约咨询。<br />
            为完成预约咨询，您需提供以下信息：<text class="bold-text"
              >您的姓名、紧急联系人姓名及电话。</text
            ><br />
            在预约咨询过程中，如果您提供以下额外信息，将有助于我们给您提供更好的服务和体验：<text
              class="bold-text"
              >您的联系方式、性别、年龄、婚姻状态、是否有孩子。</text
            >但如果您不提供这些信息，将不会影响使用本服务的基本功能。<br />
            您提供的上述信息，仅限您申请的咨询师可查看，且有责任进行保密；如有法律纠纷等特殊情况，可能会被依法使用，以保障您的合法权益。<br />
            您应确保提供信息的真实性，您提供的上述信息，将在您使用本服务期间持续授权我们使用。<br />
            3、图片、文件<br />
            当您在使用<text class="bold-text"
              >编辑头像（照片浏览）、私信（发送图片、发送文件）、提交作业（上传图片、上传文件）功能时，我们会收集您主动提供的上述图片、文件内容信息，同时我们还将为便于您发送图片和文件而经过您的同意后访问您的手机存储权限。</text
            >同时，您也可以随时通过您的设备系统设置相关功能设置页面开启/取消该权限。您开启该权限即视为您授权我们可以访问、获取、收集、使用您的该等个人信息；当您取消该授权后，我们将不再收集该信息，也无法再为您提供上述与之对应的服务；但除非您依照法律的规定删除了您的个人信息，否则您的取消行为不会影响我们基于您之前的授权进行的对您个人信息的处理、存储。<br />
            4. 拍摄照片、实时音视频<br />
            用您的该等个人信息；当您取消该授权后，我们将不再收集该信息，也无法再为您提供上述与之对应的服务；但除非您依照法律的规定删除了您的个人信息，否则您的取消行为不会影响我们基于您之前的授权进行的您个人信息的处理、存储。<br />
            当您使用<text class="bold-text"
              >咨询功能（语音通话）、视频咨询功能（视频通话）、设备相机拍摄照片（编辑头像、发送图片）时，我们将访问您的设备录音（麦克风）或相机相关权限。</text
            >如您拒绝提供该权限，仅会使您无法使用该功能，但并不影响您正常使用产品与/或服务的其他功能。同时，您也可以随时通过您的设备系统设置相关功能设置页面开启/取消该权限。您开启该权限即视为您授权我们可以访问、获取、收集、使用您的该等个人信息；当您取消该授权后，我们将不再收集该信息，也无法再为您提供上述与之对应的服务；但除非您依照法律的规定删除了您的个人信息，否则您的取消行为不会影响我们基于您之前的授权进行的您个人信息的处理、存储。<br />
            5. 城市选择<br />
            <text class="bold-text"
              >当您进入心理咨询模块：浏览咨询师列表、在咨询师列表中进行城市筛选时，我们将访问您的定位权限，便于为您推荐距您更近的当前城市的心理健康服务。</text
            >如您拒绝提供该权限，仅会影响推荐服务的准确度，不会影响该基本功能的使用。同时，您也可以随时通过您的设备系统设置相关功能设置页面开启/取消该权限。您开启该权限即视为您授权我们可以访问、获取、收集、使用您的该等个人信息；当您取消该授权后，我们将不再收集该信息，也无法再为您提供上述与之对应的服务；但除非您依照法律的规定删除了您的个人信息，否则您的取消行为不会影响我们基于您之前的授权进行的您个人信息的处理、存储。<br />
            （二）开展内部数据分析和研究，第三方SDK统计服务，改善我们的产品或服务<br />
            我们收集数据是根据您与我们的互动和您所做出的选择，包括您的隐私设置以及您使用的产品和功能。我们收集的数据可能包括<text
              class="bold-text"
              >SDK/API/JS代码版本、浏览器、互联网服务提供商、IP地址、平台、时间戳、应用标识符、应用程序版本、应用分发渠道、独立设备标识符、iOS广告标识符（IDFA)、安卓广告主标识符、网卡（MAC）地址、国际移动设备识别码（IMEI）、设备型号、终端制造厂商、终端设备操作系统版本、会话启动/停止时间、语言所在地、时区和网络状态（WiFi等）、硬盘、CPU和电池使用情况、位置、AndroidID、设备传感器数据、应用列表、运行中进程信息等。</text
            ><br />
            当我们要将信息用于本策略未载明的其它用途时，会事先征求您的同意。<br />
            当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。
          </view>
          <view class="bold">三、我们如何使用 Cookie 和同类技术</view>
          <view class="thin">
            （一）Cookie <br />
            为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，网站能够存储您的偏好或购物车内的商品等数据。<br />
            <text class="blue-text"
              >我们或我们的第三方合作伙伴，可能通过放置安全的Cookie、标识符及相关技术收集您的信息，以便为您提供更个性化的用户体验和服务。我们会严格要求第三方合作伙伴遵守本政策的相关规定。您也可以通过浏览器设置管理Cookie。但请注意，如果停用Cookie，您可能无法享受最佳的服务体验，某些服务也可能无法正常使用。</text
            ><br />
            我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止 Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。
          </view>
          <view class="bold">四、我们如何保护您的个人信息</view>
          <view class="thin">
            （一）我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据（如信用卡信息）时受 SSL 加密保护；我们同时对我们网站提供 https 安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。<br />
            （二）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。<br />
            （三）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他我们用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。<br />
            （四）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。<br />
            （五）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。<br />
            同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。<br />
          </view>
          <view class="bold">五、您的权利</view>
          <view class="thin">
            按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：<br />
            （一）访问您的个人信息<br />
            您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：<br />
            账号信息——如果您希望访问或编辑您的账号中的个人资料信息和支付信息、更改您的密码、添加安全信息或绑定第三方账号等，您可以通过访问【我的】或【个人中心】执行此类操作。<br />
            如果您无法通过上述链接访问这些个人信息，您可以发送电子邮件至【yxyy2022@qq.com】。我们将在30天内回复您的访问请求。<br />
            （二）更正您的个人信息<br />
            当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正。您可以通过“（一）访问您的个人信息”中罗列的方式提出更正申请。<br />
            如果您无法通过上述链接更正这些个人信息，您可以发送电子邮件至【yxyy2022@qq.com】。我们将在30天内回复您的更正请求。<br />
            （三）删除您的个人信息<br />
            在以下情形中，您可以向我们提出删除个人信息的请求：<br />
            1、如果我们处理个人信息的行为违反法律法规；<br />
            2、如果我们收集、使用您的个人信息，却未征得您的同意；<br />
            3、如果我们处理个人信息的行为违反了与您的约定；<br />
            4、如果您注销了蓝鸟心理账号时；<br />
            5、如果我们终止服务及运营时；<br />
            若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。<br />
            当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。<br />
            （四）改变您授权同意的范围<br />
            每个业务功能需要一些基本的个人信息才能得以完成（见本政策“第一部分”）。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。<br />
            您可以通过“（一）访问您的个人信息”中罗列的方式自行操作。<br />
            当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。<br />
            （五）您有权注销您的账号<br />
            1、您可以通过蓝鸟心理-进入个人中心“我的”-进入“设置”-进入“账号与绑定”-选择“注销”或通过联系蓝鸟心理客服来申请注销您的账号，账号注销的处理期限为5个工作日。<br />
            2、当您注销账号后，您将无法再以该账号登录和使用我们的产品与服务；且该账号在蓝鸟心理及旗下的其他产品与服务使用期间已产生的但未消耗完毕的权益及未来的逾期利益等全部权益将被清除；该账号下的内容、信息、数据、记录等将会被删除或匿名化处理（但法律法规另有规定或监管部门另有要求的除外，如依据《中华人民共和国网络安全法》规定，您的网络操作日志将至少保留六个月的时间）；蓝鸟心理账号注销完成后，将无法恢复<br />
            如果您在处置您的个人信息时有任何疑问，您可以通过本隐私权政策第八条“联系我们”中公示的联系方式与我们沟通解决。<br />
            （六）约束信息系统自动决策<br />
            在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。<br />
            （七）响应您的上述请求<br />
            为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在三十天内做出答复。<br />
            对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。<br />
            在以下情形中，按照法律法规要求，我们将无法响应您的请求：<br />
            1、与国家安全、国防安全有关的；<br />
            2、与公共安全、公共卫生、重大公共利益有关的；<br />
            3、与犯罪侦查、起诉和审判等有关的；<br />
            4、有充分证据表明您存在主观恶意或滥用权利的；<br />
            5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。<br />
          </view>
          <view class="bold"> 六、第三方服务 </view>
          <view class="thin">
            为保障蓝鸟心理小程序的稳定运行、提供相关服务或实现相关功能，蓝鸟心理服务可能链接至第三方提供的社交媒体、软件开发包（SDK）或其他服务（包括网站或其他服务形式）以实现前述目的。在符合相关法律法规的前提下，我们可能会允许接入的第三方收集用户信息，用于向用户提供服务。第三方处理用户信息的情况请参见第三方的隐私政策或服务协议。您有权拒绝第三方在提供服务时收集为提供服务所必须的个人信息，但这将可能导致您无法在蓝鸟心理中使用该第三方服务。具体包括：<br />
            （一）您可利用“分享”键将某些内容分享到第三方平台，或您可利用第三方服务登录蓝鸟心理服务。这些功能可能会收集您的个人信息（包括您的日志信息），并可能在您的电脑装置COOKIES，从而正常运行上述功能；<br />
            （二）我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站；<br />
            （三）其他接入第三方服务的情形。为实现本政策中声明的目的，我们可能会接入第三方服务商提供的SDK或其他类似的应用程序，并将我们依照本政策收集的您的某些信息共享给该等第三方服务商，以便提供更好的客户服务和用户体验。 <br />
            <br />
            另外，根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用您的相关个人信息无需征求您的授权同意：<br />
            1） 与国家安全、国防安全等国家利益直接相关的；与公共安全、公共卫生、公共知情等重大公共利益直接相关的；<br />
            2）与犯罪侦查、起诉、审判和判决执行等直接相关的；<br />
            3）出于维护您或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的；<br />
            4）所收集的个人信息是您自行向社会公众公开的；<br />
            5）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；<br />
            6）根据您要求签订和履行合同所必需的；<br />
            7）用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；<br />
            8）为开展合法的新闻报道所必需的；<br />
            9）出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；<br />
            10）法律法规规定的其他情形。<br />
            <br />
            请您理解，我们向您提供的功能和服务是不断更新和发展的，如果某一功能或服务未在前述说明中且收集了您的信息，我们会通过页面提示、交互流程、网站公告等方式另行向您说明信息收集的内容、范围和目的，以征得您的同意。<br />
            <br />
            请您注意，目前我们不会主动从本公司外的第三方获取您的个人信息。如未来为业务发展需要从第三方间接获取您的个人信息，我们会在获取前向您告知个人信息的来源、类型及使用范围，如我们开展业务需进行的个人信息处理活动超出您原本向第三方提供个人信息时的授权同意范围，我们将在处理您该等个人信息前征得您的授权同意；此外，我们也将会严格遵守相关法律法规的规定，并要求第三方保障其提供的信息的合法性。
          </view>
          <view class="bold"> 七、本隐私权政策如何更新 </view>
          <view class="thin">
            我们可能适时会对本隐私权政策进行调整或变更，本隐私权政策的任何更新将以标注更新时间的方式公布在我们网站上，除法律法规或监管规定另有强制性规定外，经调整或变更的内容一经通知或公布后的7日后生效。如您在隐私权政策调整或变更后继续使用我们提供的任一服务或访问我们相关网站的，我们相信这代表您已充分阅读、理解并接受修改后的隐私权政策并受其约束。
          </view>
          <view class="bold">八、如何联系我们</view>
          <view class="thin"
            >如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与我们联系：
            <br />
            易馨亿翼（上海）信息科技有限公司 <br />
            客服微信<br />
            邮箱：yxyy2022@qq.com <br />
            一般情况下，我们将在三十天内回复。<br />
          </view>
        </view>
        <view class="pop-btn agree" v-if="agree" @click="close">关闭</view>
        <template v-else>
          <view class="pop-btn" v-if="second > 0"
            >阅读倒计时 {{ second }}S</view
          >
          <view class="pop-btn agree" v-else @click="close">我同意授权</view>
        </template>
      </view>
    </u-popup>
  </view>
</template>

<script>
/**
 * @property {Number} current 当前选中的项（默认0）
 */
//全局混入
import { publicMixin } from '../../mixin/public.js'
import { rpxToPx } from '../../utils/util.js'
export default {
  name: 'agreement',
  mixins: [publicMixin],
  data() {
    return {
      timer: ''
    }
  },
  // 此处定义传入的数据
  props: {
    show: {
      type: Boolean,
      value: true
    },
    type: {
      type: String,
      value: 0 //0 咨询服务协议  1课程购买协议 2 测评购买协议 3 知情同意
    },
    agree: {
      type: Boolean,
      value: false
    },
    name: {
      type: String,
      value: ''
    },
    consultant: {
      type: String,
      value: ''
    },
    second: {
      type: Number,
      value: 0
    }
  },
  created() {},
  methods: {
    close() {
      this.$emit('closeAgreement', false)
      this.$emit('agreeAgreement', true)
    }
  },
  watch: {
    show(newVal) {
      if (newVal == true) {
        clearInterval(this.timer)
        this.timer = null
        this.timer = setInterval(() => {
          var leftTime = this.second
          leftTime--
          if (leftTime < 0) {
            clearInterval(this.timer)
            return false
          }
          this.$emit('secondChange', leftTime)
        }, 1000)
      } else {
        this.close()
      }
    }
  }
}
</script>

<style lang="less" scoped>
@import './index.less';
</style>
